articles/2020-Curry2020/Curry2020.org
#+TITLE: Real-time Linked Dataspaces (Review)
#+AUTHOR: Ivan Salvadori
#+DATE: <2020-06-27 sáb>
#+LANGUAGE: en
#+DESCRIPTION: Review
#+INFOJS_OPT: path:../../HtmlTemplate/ccReport.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />
#+TODO: TODO(t) STARTED(s) WAITING(w) | DONE(d) CANCELED(c)

This article is a review of Curry, E. (2020). Real-time Linked Dataspaces. Springer International Publishing. https://doi.org/10.1007/978-3-030-29665-0

* Preliminaries 
It starts describing challenges in handling data integration and its corresponding activities. It also discusses the number of connected devices from IoT-based infrastructure, producing a huge amount of data. Traditional approaches to data management are not sufficient to deal with it. As a result, it is increasing the number of data silos. A paradigm shift is necessary to overcome the challenges. Moreover, a new class of information management and processing system is required to support distributed real-time applications. These systems have to be able to handle semantically heterogeneous databases and perform integration involving thousands of data sources.

The Pareto principle says that 20% of the effort delivers 80% of the results.
This has been valid for many aspects of computer science.
For example, 20% of bugs that cause 80% of the system crashes.
However, the current way large-scale data ecosystem infrastructures are designed does not fit that principle.
This book is a step towards unlocking the Pareto effect over data.

#+BEGIN_QUOTE
"This book explores the dataspace paradigm as an alternative best-effort approach
to data management with data ecosystems. 
It establishes the theoretical foundations and principles of Real-time Linked Dataspaces as a data platform for intelligent systems, and introduces a set of specialised best-effort techniques and models to enable loose administrative proximity and semantic integration for managing and processing events and streams."
#+END_QUOTE






* DONE A Data Platform for Intelligent Systems
  CLOSED: [2020-07-03 sex 18:28]

** Summary
A digital revolution is turning traditional infrastructure into sophisticated smart systems, like autonomous vehicles, and Industry 4.0.
This revolution creates smart environments powered by digital technologies such as the Internet of things, big data, and artificial intelligence.
However, smart environments require a new class of systems to support diverse distributed real-time data.
The critical requirements of such systems are the capability of processing data on-the-fly with low latency.
Real-time Linked Dataspaces (RLD) address these requirements by combining pay-as-you-go data management with techniques for flexible data integration and real-time, working as a data platform for intelligent systems within smart environments.

*** Foundations
Real-time Linked Dataspaces lie at the intersection of the fields of:

 + *Data Management*: data ecosystems, pay-as-you-go, knowledge graphs;
 + *Distributed Systems*: Internet of things, event and stream processing;
 + *Artificial Intelligence*: intelligent systems;
 + *Ubiquitous Computing*: smart environments.

The following foundations present recent developments with regard to data-intensive technics:

 - *Intelligent Systems*: There are several definitions of intelligent systems. Most of them include the adoption of artificial intelligence. Intelligent systems are those systems capable of gather, represent, reason, and interpret data. On top of that, an intelligent system can learn, extract patterns and meaning, derive new information, learn from experience, and identify strategies and behaviors to act intelligently.

 - *Smart Environments*: A Smart environment is defined by several and complementary definitions. Most of them include ubiquitous features to systems that represent in some kind the physical world.

 - *Internet of Things*: IoT is a key driver for implementing smart environments. The adoption of IoT results in interaction paradigms through cognitive and behavioral models. It enables the use of low-cost sensors that collect and share data. New forms of data processing are required to deal with the volume, variety, and velocity of data generated by those sensors.

 - *Data Ecosystems*: A data ecosystem is a system that allows value to be extracted from data supported by organizations and individuals. Data ecosystems bring together data from multiple intelligent systems.

A key aspect for enabling the adoption of data ecosystems for intelligent systems consists of supporting the sharing and management of data among systems in the ecosystem. 
Large scale data platforms have been adopted to provide secure and trusted data sharing amongst a group of participants. 
In the context of smart environments, a data platform would support continuous, coordinated data flows, seamlessly moving data among intelligent systems.

Dataspaces are not a data integration approach.
Actually, dataspace is a paradigm that supports the co-existence of heterogeneous data that does not require an immediately unified schema or integration.
Instead, data integration is postponed until required.


** Comments

This chapter starts with an overview of the ability of humans to store, analyze, and share information.
This overview shows the evolution of data management technics from primal mechanisms to modern cyber-systems.

It seems that the authors use the terms "real-time" and "on-the-fly" interchangeably.
It is a fact that laypeople tend to use the term "real-time" to express "online" or "on-the-fly" or "the most recent" and similar connotations.
However, in the context of computer science for an audience of specialists, I would reserve "real-time" concepts for addressing that kind of computing that uses deadlines.

The authors place RLD at the intersection of several fields.
However, I disagree with the attributes they associate with each field.
For example, pay-as-you-go associated with data management.
This feature could be applied to other fields, such as distributed systems that adopt it for managing computing resources. 
The same is valid to event and stream processing, that be applied to other fields.
In other words, these features do not reflect properly their corresponding fields.
On the other hand, when presenting the necessary foundations, the authors provide a much better explanation in which present the multiple possible combinations of such features.  


* TODO Enabling Knowledge Flows in an Intelligent Systems Data Ecosystem

* TODO Dataspaces: Fundamentals, Principles, and Techniques

* TODO Fundamentals of Real-time Linked Dataspaces

* TODO Data Support Services for Real-time Linked Dataspaces

* TODO Catalog and Entity Management Service for Internet of Things-Based Smart Environments 

* TODO Querying and Searching Heterogeneous Knowledge Graphs in Real-time Linked Dataspaces

* TODO Enhancing the Discovery of Internet of Things-Based Data Services in Real-time Linked Dataspaces

* TODO Human-in-the-Loop Tasks for Data Management, Citizen Sensing, and Actuation in Smart Environments

* TODO Stream and Event Processing Services for Real-time Linked Dataspaces

* TODO Quality of Service-Aware Complex Event Service Composition in Real-time Linked Dataspaces

* TODO Dissemination of Internet of Things Streams in a Real-time Linked Dataspace

* TODO Approximate Semantic Event Processing in Real-time Linked Dataspaces

* TODO Enabling Intelligent Systems, Applications, and Analytics for Smart Environments Using Real-time Linked Dataspaces

* TODO Autonomic Source Selection for Real-time Predictive Analytics Using the Internet of Things and Open Data

* TODO Building Internet of Things-Enabled Digital Twins and Intelligent Applications Using a Real-time Linked Dataspace

* TODO A Model for Internet of Things Enhanced User Experience in Smart Environments

* TODO Future Research Directions for Dataspaces, Data Ecosystems, and Intelligent Systems


* Final Considerations
